In [1]:
#读取模块
import pandas as pd
import numpy as np

In [2]:
#读取数据
data = pd.read_excel('厦门民航进出港客流每日统计数据.xlsx')

In [3]:
data

     序号         日期   班次  出港旅客数  进港旅客数  吞吐量合计
0     1 2017-01-13  521  34584  33198  67782
1     2 2017-01-14  523  35259  32626  67885
2     3 2017-01-15  520  35422  33841  69263
3     4 2017-01-16  519  35173  33892  69065
4     5 2017-01-17  514  35143  34011  69154
..   ..        ...  ...    ...    ...    ...
155  36 2016-02-28  516  33400  28684  62084
156  37 2016-02-29  509  31580  27136  58716
157  38 2016-03-01  489  28540  25628  54168
158  39 2016-03-02  493  27837  26631  54468
159  40 2016-03-03  490  26620  27540  54160

[160 rows x 6 columns]

# **Pandas特性**

## Series

---

### 构造方法

1. 基本构造法

In [4]:
obj = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

2. 字典构造法

In [5]:
obj2 = pd.Series({'ohio': 35000, 'Texas': 71000, 'oregon': 16000},
                 index=['Texas', 'ohio', 'California', 'oregon'])
obj3 = pd.Series([10000, 30000, 80000], index=['ohio', 'California', 'oregon'])
print(obj2)
print('------------')
print(obj3)

Texas         71000.0
ohio          35000.0
California        NaN
oregon        16000.0
dtype: float64
------------
ohio          10000
California    30000
oregon        80000
dtype: int64

---

### 特性

1. 索引

In [33]:
obj[['b', 'a', 'd']]

b    7
a   -5
d    4
dtype: int64

In [32]:
obj[2:4]    #切片出2-3

a   -5
c    3
dtype: int64

2. 运算

In [7]:
obj>0

d     True
b     True
a    False
c     True
dtype: bool

In [8]:
obj + 2

d    6
b    9
a   -3
c    5
dtype: int64

In [9]:
obj2 + obj3    #缺省与非缺省相加为缺省

California        NaN
Texas             NaN
ohio          45000.0
oregon        96000.0
dtype: float64

---

### 变量

In [10]:
obj2.name = 'population'
obj2.index.name = 'state'
obj2

state
Texas         71000.0
ohio          35000.0
California        NaN
oregon        16000.0
Name: population, dtype: float64

In [54]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']    #一定要对齐
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: population, dtype: int64

---

### 方法

In [11]:
pd.isnull(obj2)    #notnull相似

state
Texas         False
ohio          False
California     True
oregon        False
Name: population, dtype: bool

---

---

## DataFrame

-------

相当于带有名字的多个Series结构体

---

### 构造

1. 用一个字典指定每列的数据

In [12]:
data = {'state': ['Ohio', 'ohio', 'ohio', 'Nevada', 'Nevada', 'Nevada'],
          'year': [2000, 2001, 2002, 2001, 2002, 2003],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame1 = pd.DataFrame(data, columns=['year', 'state', 'pop'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame1

       year   state  pop
one    2000    Ohio  1.5
two    2001    ohio  1.7
three  2002    ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [20]:
frame1['year']    #与原DataFrame共享存储位置

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

2. 用嵌套字典指定每列索引的对象

In [13]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop, index=[2000, 2001, 2002, 2003])    #重新指定index的特性
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

---

### 特性

In [21]:
frame1['debt']   #DataFrame只能对column索引  多嵌套一个列表取值则返回DataFrame Type

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
six      16.5
Name: debt, dtype: float64

In [15]:
frame1['debt'] = 16.5    #可赋值列表，长度需统一
frame1

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

切片与条件判断本质上是对index进行的索引

In [34]:
frame1[:2]    #特例

     year state  pop  debt
one  2000  Ohio  1.5  16.5
two  2001  ohio  1.7  16.5

In [36]:
frame1[frame1['year']>2000]

       year   state  pop  debt
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [84]:
#index参数索引性  Series与DataFrame皆有
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame1['debt2'] = val
frame1

       year   state  pop  debt2  debt
one    2000    Ohio  1.5    NaN  16.5
two    2001    ohio  1.7   -1.2  16.5
three  2002    ohio  3.6    NaN  16.5
four   2001  Nevada  2.4   -1.5  16.5
five   2002  Nevada  2.9   -1.7  16.5
six    2003  Nevada  3.2    NaN  16.5

----

### 变量

In [76]:
frame1.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [98]:
frame1.columns

Index(['year', 'state', 'pop', 'debt2', 'debt'], dtype='object', name='test')

In [95]:
frame1.values

array([[2000, 'Ohio', 1.5, nan, 16.5],
       [2001, 'ohio', 1.7, -1.2, 16.5],
       [2002, 'ohio', 3.6, nan, 16.5],
       [2001, 'Nevada', 2.4, -1.5, 16.5],
       [2002, 'Nevada', 2.9, -1.7, 16.5],
       [2003, 'Nevada', 3.2, nan, 16.5]], dtype=object)

In [94]:
frame1.index.name = 'number'
frame1.columns.name = 'test'

---

### 方法

In [65]:
frame1.head()

       year   state  pop
one    2000    Ohio  1.5
two    2001    ohio  1.7
three  2002    ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [25]:
frame1.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  ohio  ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt   16.5  16.5  16.5    16.5    16.5    16.5

In [26]:
frame1.reindex(['one', 'three', 'two'], columns=['state', 'year', 'pop'])

      state  year  pop
one    Ohio  2000  1.5
three  ohio  2002  3.6
two    ohio  2001  1.7

In [31]:
frame1.drop(['one', 'two'] #axis=1)

       year   state  pop  debt
three  2002    ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [38]:
frame1.add(frame2, fill_value=0)    #两个表合并的方法，避开缺省的问题

NameError: name 'frame2' is not defined

In [40]:
frame1.sort_index()    #axis=1, ascending=False(降序)

       year   state  pop  debt
five   2002  Nevada  2.9  16.5
four   2001  Nevada  2.4  16.5
one    2000    Ohio  1.5  16.5
six    2003  Nevada  3.2  16.5
three  2002    ohio  3.6  16.5
two    2001    ohio  1.7  16.5

In [42]:
frame1.sort_values(by='pop')

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    ohio  1.7  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5
three  2002    ohio  3.6  16.5

In [43]:
frame1.sum()    #axis=1

year                              12009
state    OhioohioohioNevadaNevadaNevada
pop                                15.3
debt                                 99
dtype: object

In [45]:
frame1.idxmax()    #计算每行最大值所在的索引值

TypeError: reduction operation 'argmax' not allowed for this dtype

In [47]:
frame1['year'].value_counts()    #其实是Serious的方法

2002    2
2001    2
2003    1
2000    1
Name: year, dtype: int64